Catalogs/рс_Требование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Требование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>рс_Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_СтатусыТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обсуждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_Требование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьПоУмолчанию();
	Иначе
		ЗаполнитьПоОснованию();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
     //Элементы.ГруппаСообщения.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Объект.Статус 	= Перечисления.рс_СтатусыТребований.Новое;
	Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()
	
	ЗаполнитьПоУмолчанию();
	
	Если Параметры.Свойство("рс_Объект") Тогда 
		 Объект.рс_Объект = Параметры.рс_Объект;
	КонецЕсли;

	Если Параметры.Свойство("Основание") Тогда 
		 Объект.Основание = Параметры.Основание;
	 КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Содержание 	= Новый ХранилищеЗначения(Чат, Новый СжатиеДанных(9));
	ТекущийОбъект.Описание 		= Новый ХранилищеЗначения(ОписаниеДокумент, Новый СжатиеДанных(9));  
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщение(Команда)
		
	ДобавитьНовоеСообщение();
	
	Сообщение.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(""));
	
	Модифицированность = Истина;   
	 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовоеСообщение()
		
	УЧС = Новый Массив;
	УЧС.Добавить(Чат);  
	УЧС.Добавить(Символы.ПС);
	СтрокаАвтор = Новый ФорматированнаяСтрока(ПолучитьАвтораИВремя(), Новый Шрифт(,,,,Истина,,),,,);
	УЧС.Добавить(СтрокаАвтор); 
	УЧС.Добавить(Символы.ПС);
	УЧС.Добавить(Сообщение.ПолучитьТекст());  
	УЧС.Добавить(Символы.ПС); 
		
	итСтрокаУчастники 	= Новый ФорматированнаяСтрока(УЧС);
	Чат 	= итСтрокаУчастники;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ОснованиеНажатие(Элемент, СтандартнаяОбработка) 
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект.Основание);   
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка); 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФорматированныйДокументКФорматированномуДокументу(ПриемникДокумент, ДобавляемыйДокумент) //Не нужна

	Для Инд = 0 По ДобавляемыйДокумент.Элементы.Количество() -1 Цикл
		ДобавляемыйЭлемент = ДобавляемыйДокумент.Элементы[Инд];
		Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ПараграфФорматированногоДокумента") Тогда
			НовыйПараграф = ПриемникДокумент.Элементы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараграф, ДобавляемыйЭлемент, "ТипПараграфа, ГоризонтальноеПоложение, МеждустрочныйИнтервал,Отступ");
			ДобавитьФорматированныйДокументКФорматированномуДокументу(НовыйПараграф, ДобавляемыйЭлемент);
		Иначе
			Если ТипЗнч(ДобавляемыйЭлемент) = Тип("ТекстФорматированногоДокумента")
				И Не ДобавляемыйЭлемент.Текст = "" Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Текст, Тип("ТекстФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("КартинкаФорматированногоДокумента") Тогда
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить(ДобавляемыйЭлемент.Картинка, Тип("КартинкаФорматированногоДокумента"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ДобавляемыйЭлемент,,"ЗакладкаКонца, ЗакладкаНачала, Родитель");
			ИначеЕсли ТипЗнч(ДобавляемыйЭлемент) = Тип("ПереводСтрокиФорматированногоДокумента") Тогда
				Если ТипЗнч(ДобавляемыйДокумент) = Тип("ПараграфФорматированногоДокумента") 
					И (ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.МаркированныйСписок
					Или ДобавляемыйДокумент.ТипПараграфа = ТипПараграфа.НумерованныйСписок) Тогда
					Продолжить;
				КонецЕсли;
				НовыйЭлемент = ПриемникДокумент.Элементы.Добавить( , Тип("ПереводСтрокиФорматированногоДокумента"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	Чат = ТекущийОбъект.Содержание.Получить(); 
	
	тОписаниеДокумент 	= ТекущийОбъект.Описание.Получить();
    ОписаниеДокумент 	= тОписаниеДокумент; 

	СформироватьСтрокуУчастники();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьАвтораИВремя()
	
	текстАвторВремя = "";
	
	текПользователь = ПараметрыСеанса.ТекущийПользователь; 
	текстАвторВремя = текПользователь.Наименование + " " + ТекущаяДатаСеанса();
	
	Возврат текстАвторВремя;
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,ЭтаФорма,,,,);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	НоваяСтрока = Объект.Участники.Добавить();
   	НоваяСтрока.Участник = ВыбранноеЗначение; 
		
	СформироватьСтрокуУчастники(); 
	
	ТекстУведомления 		= "Вы добавлены как участник для Требование №" + Объект.Ссылка;
	Структура 				= Новый Структура;   
	ВидСобытияОповещения 	= ПолучитьВидСобытияОповещения("Добавлен новый Участник");
	
	Структура.Вставить("Пользователь"		, ВыбранноеЗначение);
	Структура.Вставить("Источник"			, Объект.Ссылка);
	Структура.Вставить("ВидСобытия"			, ВидСобытияОповещения);
	Структура.Вставить("ТекстУведомления"	, ТекстУведомления);
	//Структура.Вставить("ДопПараметры"		, Неопределено);
	
    рс_ОбщийМодульСервер.ДобавитьУведомление(Структура);
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьВидСобытияОповещения(Имя)
	
	поискИмя = Справочники.ВидыСобытийОповещений.НайтиПоНаименованию(Имя); 
	Если Не ЗначениеЗаполнено(поискИмя) Тогда 
		СпрОбъект = Справочники.ВидыСобытийОповещений.СоздатьЭлемент();
		СпрОбъект.Наименование 		= Имя;  
		СпрОбъект.КатегорияСобытия 	= Справочники.КатегорииСобытийОповещений.Напоминания;
		СпрОбъект.Записать();
		
		поискИмя = СпрОбъект.Ссылка;
	КонецЕсли;
	
	Возврат поискИмя; 
	
КонецФункции

&НаСервере
Процедура СформироватьСтрокуУчастники()
	
   	 УЧС = Новый Массив;
	 Для Каждого СтрУчастник Из Объект.Участники Цикл  
		 тУчастник = Новый ФорматированнаяСтрока(Строка(СтрУчастник.Участник),,,,ПолучитьНавигационнуюСсылку(СтрУчастник.Участник));
		 УЧС.Добавить(тУчастник);
		 УЧС.Добавить(" ");
	 КонецЦикла;	  
	 
	итСтрокаУчастники 	= Новый ФорматированнаяСтрока(УЧС); 
	
	СтрокаУчастники 	= итСтрокаУчастники;   
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьУчастников(Команда)
		
	ОчиститьУчастниковСервер(); 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьУчастниковСервер()
	
	Объект.Участники.Очистить();
	СформироватьСтрокуУчастники();	
	
	Модифицированность = Истина;
	
КонецПроцедуры
